Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་གང་གིས་ཁྱོད་ཀྱི་སྐུ་མཐོང་བ། །བྱང་ཆུབ་ལམ་ལ་མངོན་དུ་བལྟས་པར་འགྱུར། །
en: Whatever being sees your body Will be facing the path to enlightenment.

source: དེ་ལྟར་ཐོས་ནས་རབ་ཏུ་སེམས་དགའ་ལ། །མཐོང་བ་ཙམ་གྱིས་ཉོན་མོངས་ཞི་མཛད་པས། །
en: {29} “Merely seeing you causes the kleśas to cease In one who rejoices on hearing your name.

source: བསྐལ་པ་བསམ་ཡས་ངན་སོང་གནས་ཀྱང་ཆུང་། །ཁྱོད་ཀྱི་ཞལ་ལྟའི་དོན་དུ་མོས་པར་བགྱི། །
en: I would endure countless kalpas in the lower realms So that I could see your face.

source: ཞིང་རྣམས་སྟོང་གི་རྡུལ་སྙེད་ལུས་བྱས་ཏེ། །དེ་སྙེད་བསྐལ་པ་བརྒྱུད་དེ་ཁྱོད་འདྲ་བའི། །སྤུ་རྩེ་གཅིག་གི་ཡོན་ཏན་ལེགས་བརྗོད་ཀྱང་། །ལེགས་པའི་མཐར་ཕྱིན་ནམ་དུའང་མི་འགྱུར་རོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ལ་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་ནས། །
en: {30} “If I were to create as many bodies as there are atoms in a thousand realms, And for the duration of that same number of kalpas They were to describe the qualities of just one of your pores, They would never be able to reach the end of that description.”

source: མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་བའི་བཤེས་གཉེན་ལ་བསྙེན་བཀུར་བྱ་བས། མ་ངོམས་བཞིན་དུ་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: {31} Then Sudhana, the head merchant’s son, bowed his head to the feet of the night goddess Vāsantī, circumambulated the night goddess Vāsantī many hundreds of thousands of times, keeping her to his right, and, looking back again and again with unfulfilled longing, departed from the night goddess Vāsantī.

source: བམ་པོ་དྲུག་པ། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ཐོག་མ་བྱང་ཆུབ་ཏུ་ཞུགས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པ་ནི་ཁོང་དུ་ཆུད་པར་བྱེད། བྱང་ཆུབ་སེམས་དཔའི་སྙིང་པོ་ཡང་དག་པར་འབྱུང་བ་ལ་ནི་རྗེས་སུ་དཔྱོད། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་རྒྱ་མཚོ་ལ་ནི་ཡོངས་སུ་འཇུག །བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་ནི་ཡོངས་སུ་སྦྱོང་། བྱང་ཆུབ་སེམས་དཔའི་སའི་དཀྱིལ་འཁོར་ནི་ཡོངས་སུ་གནོན། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ནི་རྒྱ་ཆེར་བྱེད། བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བ་རྒྱ་མཚོ་ནི་རྗེས་སུ་འབྲང་། ཐམས་ཅད་མཁྱེན་པའི་སྣང་བ་ཆེན་པོ་རྒྱ་མཚོ་ལ་ནི་རྣམ་པར་ལྟ། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་གཞོལ་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོའི་སྤྲིན་ནི་རྒྱ་ཆེར་བྱེད། མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ནི་ཞིང་ཐམས་ཅད་དུ་ཕྱི་མའི་མཐར་བྱིན་གྱིས་བརླབ་པས་མངོན་པར་སྒྲུབ་ཅིང་། མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་གང་ན་བ་དེར་སོང་སྟེ། མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ལ།
en: Samanta­gambhīra­śrī­vimala­prabhā Chapter 35 Then Sudhana, the head merchant’s son, contemplating the night goddess Vāsantī’s first entry into the pure domain of aspiration to enlightenment, analyzing the arising of the essence of a bodhisattva, comprehending the ocean of bodhisattva prayer, purifying the bodhisattva path of perfections, overcoming the domain of the bodhisattva levels, augmenting the domain of bodhisattva conduct, following an ocean of the setting-forth of bodhisattvas, looking at the ocean of the great illumination of omniscience, increasing the bodhisattva clouds of great compassion intent on saving all beings, and attaining the blessing of the completely good bodhisattva conduct and prayer of the night goddess Vāsantī that extends to the limits of all realms, went to the location of the night goddess Samanta­gambhīra­śrī­vimala­prabhā.

source: ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཀྱི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་བ་ཡང་དག་པར་རྫོགས་པའི་བྱང་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: Having reached her, he bowed his head to the feet of the night goddess Samanta­gambhīra­śrī­vimala­prabhā, circumambulated the night goddess Samanta­gambhīra­śrī­vimala­prabhā many hundreds of thousands of times, keeping her to his right, and then stood before her and, with palms together, said, “Āryā, I have developed the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་སྤྱོད་པ་དང་། ཇི་ལྟར་འབྱུང་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏོ། །
en: However, I do not know how a bodhisattva practices on the level of a bodhisattva, how a bodhisattva sets forth, how a bodhisattva accomplishes.”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་སྤྱོད་པ་དང་། འབྱུང་བ་དང་ཡོངས་སུ་འགྲུབ་པ་འདྲི་བ་ལེགས་སོ། །
en: She answered, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment and that you ask how to practice, set forth, and accomplish on the level of a bodhisattva.

source: ལེགས་སོ། །རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཡོངས་སུ་གྲུབ་པ་ཡིན་ཏེ།
en: It is through possessing ten qualities that bodhisattvas accomplish bodhisattva conduct.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་དུ་གྱུར་པར་མཐོང་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པ་རྣམ་པར་དག་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྐུ་མཚན་སྣ་ཚོགས་དང་ལྡན་པ་རྣམ་པར་བལྟ་བའི་མིག་རྣམ་པར་དག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཁ་དོག་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་རྣམ་པར་དམྱིགས་པར་བྱ་བ་ལ་འཇུག་པ་དང་།
en: What are these ten?

source: སངས་རྒྱས་ཀྱི་ཆོས་སྣང་བའི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཚད་མེད་པ་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱི་ཚད་ཀྱིས་འཇུག་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་ནས་འོད་ཟེར་རྒྱ་མཚོ་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་པ་དང་། སེམས་ཅན་སྣ་ཚོགས་ཀྱི་དོན་དུ་བཀྱེ་བ་ལ་འཇུག་པ་དང་། བ་སྤུའི་བུ་ག་རེ་རེ་ནས་འོད་འཕྲོ་བ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁ་དོག་དུ་འདུག་པ་རྒྱ་མཚོ་སྟོན་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སངས་རྒྱས་ཀྱིས་སྤྲུལ་པ་རྒྱ་མཚོས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་བཀང་ཞིང་སེམས་ཅན་འདུལ་བའི་བྱིན་གྱི་རླབས་ལ་འཇུག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་གསུང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབྱངས་ཀྱི་ཡན་ལག་དང་ལྡན་པས། དུས་གསུམ་དུ་བྱུང་བའི་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་སྒྲོག་པས། མདོ་སྡེ་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་འབྲུག་སྒྲ་འབྱིན་པའི་དཀྱིལ་འཁོར་ལ་འཇུག་པ་དང་།
en: They are (1) the pure attainment of the samādhi that directly perceives all the tathāgatas; (2) the pure eyesight that sees the bodies, endowed with the various signs, of all the buddhas; (3) realizing the perception of the centerless, endless ocean of the colors of the tathāgatas; (4) comprehending the extent of the entire realm of phenomena and the measureless ocean of the domain of the radiant qualities of the buddhas; (5) comprehending the ocean of light rays from the pores of all the tathāgatas that are as numerous as all beings and radiate to benefit the variety of beings; (6) seeing an ocean of light rays, the colors of all jewels, coming from each pore; (7) comprehending the ocean of emanations of the buddhas that in each instant of mind pervade the entire realm of phenomena and give the blessing that guides beings; (8) comprehending the domain of thunder from the clouds of all the sūtras through possessing the speech of the tathāgatas, which has the aspects of the voices of all beings, and the sound of the wheel of the Dharma appearing in the three times; (9) comprehending the centerless and endless ocean of the signs of the buddhas; and (10) comprehending the guiding of beings through the manifestation of the inconceivable emanations of the buddhas.

source: སངས་རྒྱས་ཀྱི་མཚན་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་འཇུག་པ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བསྟན་པས་སེམས་ཅན་འདུལ་བ་ལ་འཇུག་པ་སྟེ། རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་འདི་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཡོངས་སུ་གྲུབ་པ་ཡིན་ནོ། །
en: “Noble one, the bodhisattvas who possess these ten qualities accomplish bodhisattva conduct.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ། བསམ་གཏན་ཞི་བའི་བདེ་བས་ཀུན་ཏུ་རྣམ་པར་གནོན་པ་ཐོབ་པ་སྟེ།
en: “Noble one, I have attained the bodhisattva liberation called complete subjugation through the bliss of the peace of śamatha.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་དེའི་མཐུས། དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་མཐོང་སྟེ། དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ལའང་འཇུག་གོ །
en: “Noble one, through its power I see all the tathāgatas who are in the three times, and I perceive the completely pure buddha realms of those tathāgatas.

source: འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དང་། ཏིང་ངེ་འཛིན་མཐའ་དང་དབུས་མེད་པའི་རྣམ་པར་འཕྲུལ་བ་རྒྱ་མཚོ་དང་། སྔོན་གྱི་ཚུལ་རྒྱ་མཚོ་དང་། མཚན་རྒྱ་མཚོ་ལ་འང་འཇུག་གོ །
en: I perceive the ocean of their assemblies of followers, the ocean of their centerless and endless miraculous manifestations from samādhi, the ocean of their past practices, and the ocean of their names.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་འཁོར་བ་རྣམ་པ་ཐ་དད་པ་ལའང་འཇུག་གོ །
en: I also perceive each separate turning of the wheel of the Dharma by those tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་སྣ་ཚོགས་དང་། དབྱངས་ཀྱི་ཡན་ལག་རྣམ་པ་ཐ་དད་པ་དང་། དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་ཆོས་ཀྱི་དབྱིངས་མཐའ་དང་དབུས་མེད་པའི་སྐུའང་འཇུག་སྟེ།
en: I perceive the various lifespans and different aspects of voice of those tathāgatas and the bodies of those tathāgatas who have the nature of the centerless and limitless realm of phenomena.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་དངོས་པོར་མངོན་པར་ཞེན་པའང་མེད་དོ། །
en: “Those tathāgatas are not attached to things as being existent.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་བཞུད་པ་འགགས་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་བཞུད་པ་མེད་པའོ། །
en: Those tathāgatas do not go because of their cessation of going through all worlds.

source: རང་བཞིན་གྱིས་བྱུང་བ་མེད་པས་ན། དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་བྱོན་པ་མེད་པའོ། །
en: Those tathāgatas do not arrive because their nature has no arising.

source: མི་སྐྱེ་བའི་ཆོས་ཉིད་དང་། མཉམ་པའི་སྐུ་མངའ་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་མ་སྐྱེས་པའོ། །
en: Those tathāgatas are unborn because they have a body that is the same as the birthless true nature.

source: མི་སྐྱེ་བའི་མཚན་ཉིད་དང་ལྡན་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་མ་འགགས་པའོ། །
en: Those tathāgatas are unceasing because they have the characteristic of birthlessness.

source: སྒྱུ་མའི་རྣམ་པ་ལྟ་བུར་མཐོང་ཞིང་རྣམ་པར་དམིགས་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་མི་བདེན་པ་མ་ཡིན་པའོ། །
en: Those tathāgatas are not true because of perceiving and seeing phenomena to be illusions.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་དུ་བྱུང་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་བརྫུན་པ་མ་ཡིན་པའོ། །
en: Those tathāgatas are not false because there arises benefit for all beings.

source: ཤི་འཕོ་དང་སྐྱེ་བ་ལས་རྣམ་པར་འདས་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་འཕོ་བ་མེད་པའོ། །
en: Those tathāgatas do not pass away because they have transcended death, passing, and birth.

source: ཆོས་ཀྱི་རང་བཞིན་གྱིས་འཇིག་པ་མེད་པའི་ཆོས་ཉིད་ཡིན་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་འཇིག་པ་མེད་པའོ། །
en: Those tathāgatas are not destroyed because the indestructible true nature is the nature of phenomena.

source: ངག་གི་ལམ་ཐམས་ཅད་ལས་ཡོངས་སུ་འདས་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ནི་མཚན་ཉིད་གཅིག་པའོ། །
en: All those tathāgatas have a single characteristic because of their transcendence of all paths of speech.

source: ཆོས་ཀྱི་མཚན་ཉིད་ཀྱི་རང་བཞིན་གྱི་མཐར་ཐུག་པས། དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་མཚན་ཉིད་མི་མངའ་བའོ། །
en: Those tathāgatas do not have characteristics because they are the termination of the nature of the characteristics of phenomena.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གཏན་ཞི་བའི་བདེ་བས་ཀུན་ཏུ་རྣམ་པར་གནོན་པ་འདི་དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་གྱི་དཀྱིལ་འཁོར་སྣང་བས་ཤིན་ཏུ་རྒྱ་ཆེར་བྱེད་དོ། །ཤིན་ཏུ་ཡངས་པར་བྱེད་དོ། །ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །རྟོགས་པར་བྱེད་དོ། །མཉམ་པར་བྱེད་དོ། །མངོན་པར་སྒྲུབ་བོ། །གཞི་སྙོམས་པར་བྱེད་དོ། །རབ་ཏུ་འཇུག་གོ། རྣམ་པར་འཕེལ་བར་བྱེད་དོ། །ངེས་པར་སེམས་སོ། །ཉེ་བར་རྟོག་གོ །དྲན་པར་བྱེད་དོ། །སྤྱོད་ཡུལ་དུ་བྱེད་དོ། །བརྟན་པར་བྱེད་དོ། །སྣང་བར་བྱེད་དོ། །རབ་ཏུ་བརྗོད་དོ། །རྣམ་པར་དཔྱོད་དོ། །
en: “Noble one, I perceive all tathāgatas in that way, and through the radiance of the tathāgatas’ domain of dhyāna, I increase this bodhisattva liberation called complete subjugation through the bliss of the peace of śamatha; I make it vast, perceive it, realize it, make it even, accomplish it, make it level, enter it, augment it, contemplate it, reflect upon it, am mindful of it, make it my field of practice, make it firm, illuminate it, explain it, divide it, categorize it, unite it, and have conviction in it.

source: རྣམ་པར་འབྱེད་དོ། །ཚོགས་སུ་བྱེད་དོ། །ཡིད་ཆེས་པར་བྱེད་དོ། །ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་རྒྱུ་བ་མེད་པའི་སྙིང་རྗེ་ཆེན་པོ་དེ་ལ་གནས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་ཡང་དག་པར་སྤྱད་པར་སེམས་རྩེ་གཅིག་ཏུ་བྱ་བའི་ཕྱིར་བསམ་གཏན་དང་པོ་སྒོམ་མོ།
en: “I meditate on the first dhyāna in order to remain in that great compassion in which there is no movement of any thought and in order to have a single-pointed mind for engaging in saving all beings.

source: ཡིད་ཀྱི་ལས་ཐམས་ཅད་ཉེ་བར་ཞི་བར་བྱ་བ་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། མཐུས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བ་ལ་དགའ་བའི་བདེ་བ་ལ་སེམས་རྩེ་གཅིག་ཏུ་བྱ་བའི་ཕྱིར། བསམ་གཏན་གཉིས་པ་སྒོམ་མོ། །འཁོར་བར་ལོག་པར་ཞུགས་པ་ལ་བཏང་སྙོམས་སུ་བྱས་ཏེ།
en: “I meditate on the second dhyāna in order to pacify all mental activity and, through the strength and power of wisdom, to have a one-pointed mind with joy of bliss in gathering all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པར་བྱ་བའི་ཕྱིར། བསམ་གཏན་གསུམ་པ་སྒོམ་མོ། །
en: “I meditate on the third dhyāna in order to have equanimity toward the distress of saṃsāra and to realize the nature of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དང་། སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱ་བའི་ཕྱིར་བསམ་གཏན་བཞི་པ་སྒོམ་མོ། །
en: “I meditate on the fourth dhyāna in order to bring an end to the kleśas and suffering of all beings.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ཡོངས་པར་བྱ་བ་དང་། ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་ཐམས་ཅད་མངོན་པར་སྒྲུབ་པ་ལ་མཁས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་འཇུག་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་རྩེ་བའི་ཡེ་ཤེས་ཐམས་ཅད་མངོན་པར་ཤེས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པར་བྱ་བའི་ཕྱིར། སྒོ་ཀུན་ནས་ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པའི་ཡེ་ཤེས་ཀྱི་ཚུལ་ཡོངས་སུ་སྦྱོང་ཞིང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བསམ་གཏན་ཞི་བའི་བདེ་བས་ཀུན་ཏུ་རྣམ་པར་གནོན་པ་འདི་སྒོམ་མོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་རྣམ་པར་ཐར་པ་འདི་སྒོམ་ཞིང་ཐབས་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ། འདི་ལྟར་ནུབ་མོ་ཞི་བར་གྱུར་པའི་ཚེ་དགའ་བ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་ཀྱིས་མི་སྡུག་པའི་འདུ་ཤེས་སྐྱེད་དོ། །མི་དགའ་བའི་འདུ་ཤེས་དང་། ཡོངས་སུ་སྐྱོ་བའི་འདུ་ཤེས་དང་། བགེགས་སུ་འགྱུར་བའི་འདུ་ཤེས་དང་། འཆིང་བའི་འདུ་ཤེས་དང་། སྲིན་མོའི་འདུ་ཤེས་དང་། མི་རྟག་པའི་འདུ་ཤེས་དང་། སྡུག་བསྔལ་བའི་འདུ་ཤེས་དང་།
en: “I purify the way of the wisdom that enters the realm of phenomena through every gateway and thus meditate on this bodhisattva liberation called complete subjugation through the bliss of the peace of śamatha in order to increase the domain of aspiration for omniscience, to become skilled in the accomplishment of an ocean of samādhis, to realize the ways of the ocean of all bodhisattva liberations, and to have the higher cognition of all the wisdoms displayed by bodhisattvas.

source: བདག་མེད་པའི་འདུ་ཤེས་དང་། རྗེ་མེད་པའི་འདུ་ཤེས་དང་། གཞན་ལ་རག་ལས་པའི་འདུ་ཤེས་དང་། རྒ་ཤིའི་འདུ་ཤེས་དང་། འདོད་པའི་ཡུལ་དང་ལོངས་སྤྱོད་ཐམས་ཅད་ལ་དགའ་བ་མེད་པའི་འདུ་ཤེས་སྐྱེད་དེ།
en: “Noble one, in that way I meditate on this liberation and ripen beings through various methods: I instill in the beings who enjoy carnal pleasure in the peace of the night the perception of it as ugliness, the perception of it as lack of pleasure, the perception of it as wearying, the perception of it as an obstacle, the perception of it as bondage, the perception of it as a rākṣasī, the perception of impermanence, the perception of suffering, the perception of no self, the perception of no ownership, the perception of dependence on others, the perception of aging and death, and the perception of a lack of joy in all indulgence in desires.

source: སེམས་ཅན་དེ་དག་ཀྱང་སེམས་དེ་ལ་ཡོངས་སུ་སྒོམ་པས། འདོད་པའི་དགའ་བ་ཐམས་ཅད་ལ། མངོན་པར་དགའ་བ་མེད་པས་ཆོས་ལ་མོས་པའི་དགའ་བ་ལ་འཇུག་ཅིང་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་ངོ་། །
en: When those beings meditate on that state of mind, they will take no delight in any indulgence in carnal pleasure and will instead aspire to enjoy the delights of the Dharma and leave home for homelessness.

source: དེ་དག་དགོན་པ་ལ་གནས་པའི་ཚེ་འང་ཆོས་དང་མཐུན་པའི་དད་པ་ཡོངས་སུ་སྐྱེད་དེ།
en: When they dwell in solitude, I instill in them the faith that accords with the Dharma.

source: སྒྲ་ཆེན་པོ་འཇིགས་པ་མི་སྙན་པའི་སྒྲ་སྐད་ཐམས་ཅད་ཀྱང་ཞི་བར་བྱེད་དོ། །མཚན་མོ་ཞི་བར་གྱུར་པ་ལྷས་སངས་རྒྱས་ཀྱི་ཆོས་ཟབ་མོ་ཡང་ཡང་དག་པར་སྟོན་ཏོ། །
en: I cause all loud, frightening, unpleasant sounds to cease, and in the peace of the night I teach the profound Dharma of the buddhas.

source: སྤང་བ་དང་འཐུན་པའི་རྐྱེན་ཡང་ཉེ་བར་སྟོན་ཏོ། །
en: “I gather the conditions necessary for renunciation.

source: ཁྱིམ་གྱི་སྒོ་ཡང་རྣམ་པར་འབྱེད་དོ། །
en: I open the door of the house for their departure.

source: ལམ་ཡང་ཡོངས་སུ་སྟོན་ཏོ། །
en: I show them the path.

source: སྣང་བས་ཀྱང་མངོན་པར་བྱེད་དོ། །
en: I illuminate it.

source: མུན་པས་ཆོད་པ་ཡང་རྣམ་པར་སེལ་ཏོ། །
en: I dispel the darkness.

source: འཇིགས་པའང་མེད་པར་བྱེད་དོ། །
en: I free them from fear.

source: རབ་ཏུ་བྱུང་བ་ལ་ཡང་ཡང་དག་པར་བསྔགས་པ་བྱེད་དོ། །
en: I praise departure from home.

source: སངས་རྒྱས་ཀྱི་ལེགས་པའང་རྗོད་དོ། །
en: I describe the qualities of buddhahood.

source: ཆོས་ཀྱི་ལེགས་པ་དང་། དགེ་འདུན་གྱི་ལེགས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་ལེགས་པ་ཡང་རྗོད་དོ། །
en: I explain the excellence of the Dharma, the excellence of the saṅgha, and the excellence of the kalyāṇamitra.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་ལའང་བསྔགས་བ་བྱེད་དོ། །
en: I praise going to a kalyāṇamitra.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་རྣམ་པར་ཐར་པ་འདི་ལ་སྒོམ་ཞིང་སེམས་ཅན་རྣམས་ཀྱི་ཆོས་མ་ཡིན་པའི་འདོད་ཆགས་ཀྱིས་ཞེན་པ་རྣམས་ཀྱི་ཆོས་མ་ཡིན་པའི་འདོད་ཆགས་ཀྱི་ཡོངས་སུ་རྟོག་པ་རྣམས་ཀྱང་མེད་པར་བྱེད་དོ། །
en: “Noble one, meditating on this liberation, I eliminate in beings the passion and desire for what is not Dharma, and thoughts of desire for what is not Dharma.

source: ཚུལ་མ་ཡིན་པའི་འདོད་པས་ནོན་པ་རྣམས་དང་། ལོག་པར་ཡོངས་སུ་རྟོག་པའི་སྤྱོད་ཡུལ་ཅན་རྣམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་དེ་དག་དང་ཡིད་ལ་བྱ་བ་དེ་དག་ཀྱང་མེད་པར་བྱེད་དོ། །
en: I dispel the thoughts and notions of those overpowered by inappropriate desires, and those whose conduct comes from wrong thoughts.

source: སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་སྐྱེ་བ་དང་། སྡིག་ཏོའི་ཡོངས་སུ་རྟོག་པ་སྐྱེས་པར་གྱུར་པ་རྣམས་ཀྱང་མེད་པར་འགྱུར་བའི་རྐྱེན་ཉེ་བར་སྒྲུབ་བོ། །དགེ་བའི་ཡོངས་སུ་རྟོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པ་དང་། སྤྱོད་པ་དང་ལྡན་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་འབྱུང་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་དང་ལྡན་པ་དང་།
en: “I create the conditions for those who have not developed evil thoughts and bad qualities to not develop them, and for those who think evil thoughts to eliminate them.

source: བྱམས་པའི་ཚུལ་དང་ལྡན་པ་དང་། སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོས་རྒྱས་པར་འགེངས་པ་དང་ལྡན་པ་དང་། ལྷ་དང་མིའི་བདེ་བ་རྣམ་པ་སྣ་ཚོགས་ཡོངས་སུ་བསྐྱེད་པ་དང་། ལྡན་པའི་ཡོངས་སུ་རྟོགས་པ་བསྐྱེད་པ་དང་། སྐྱེས་ནས་ཀྱང་ཚུལ་སྣ་ཚོགས་ཀྱི་རྐྱེན་ཉེ་བར་བསྒྲུབ་པར་བྱེད་པ་ནས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མཐུན་པའི་རྐྱེན་ཀྱང་ཉེ་བར་སྒྲུབ་པ་བྱེད་དེ།
en: “I create in various ways the supporting conditions for those who have virtuous thoughts, who practice the perfections, who are engaged in good conduct, who are engaged in accomplishing prayers for the arising of omniscient wisdom, who are engaged in the ways of love, who are pervaded by great compassion for beings, who are engaged in creating the various kinds of happiness of devas and humans, and who have given rise to such thoughts, and I create the conditions that support omniscience.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གཏན་ཞི་བའི་བདེ་བས་ཀུན་ཏུ་རྣམ་པར་གནོན་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱིས་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་མཐའ་ཡས་པའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡེ་ཤེས་རབ་ཏུ་ཐོབ་པ། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་སྤེལ་བའི་སེམས་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱི་མཐུས་སེམས་ཀྱི་སྣང་བ་རབ་ཏུ་ཐོབ་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་གནས་པའི་སེམས་དང་ལྡན་པ།
en: “Noble one, I know only the bodhisattva liberation called complete subjugation through the bliss of the peace of śamatha.

source: གནས་ཐམས་ཅད་དུ་སྒྲིབ་པ་མེད་པའི་སེམས་དང་ལྡན་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པའི་སེམས་དང་ལྡན་པ། ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་དུ་ཞུགས་པའི་སེམས་དང་ལྡན་པ། སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་མཐོང་བར་བྱ་བ་ལ་ཞུགས་པའི་སེམས་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡང་དག་པར་གཟུང་བའི་སེམས་དང་ལྡན་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མ་རིག་པའི་མུན་པ་རྣམ་པར་སེལ་བ། འཁོར་བའི་བདེ་བ་ལ་དགའ་ཞིང་སྲེད་པ་ཟད་ཅིང་མཐར་ཕྱིན་པར་འགྱུར་བའི་ལམ་གྱིས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྣང་བ་སྐྱེད་པའི་སེམས་དང་ལྡན་པ།
en: How could I know the conduct or describe the qualities of bodhisattvas who have arisen through completely good bodhisattva conduct and prayers, who have attained the wisdom of the infinite realm of phenomena, who have minds that increase all roots of merit, who have attained illumination of their minds through the power of the wisdom of all the tathāgatas, who have minds that maintain the same scope as that of all the tathāgatas, whose minds are unobscured in all situations, whose minds have perfected the aspiration for omniscience, whose minds perceive the entire ocean of realms, whose minds are focused on the vision of the entire ocean of buddhas, whose minds have received the clouds of the Dharma of all the tathāgatas, who dispel the darkness of ignorance of all beings, and who have minds that have given rise to the illumination of omniscience through the path of the final cessation of delight in and craving for saṃsāra?

source: དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་འདི་ཉིད་ན་ང་དང་ཡང་རྒྱང་མི་རིང་སྟེ། རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་གཡས་རོལ་ཅིག་ན། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: Here, not far from me, to the south of Vairocana’s bodhimaṇḍa, there is the goddess of the night named Pramudita­nayana­jagad­virocanā.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ལས་ལ་བརྩོན་པར་བྱ་བ་དྲིས་ཤིག །དེ་ནས་མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཀྱིས་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གཏན་ཞི་བའི་བདེ་བས་ཀུན་ཏུ་རྣམ་པར་གནོན་པ་འདི་ཉིད་བརྣན་ཏེ།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct?

source: བསྟན་པར་བྱ་བའི་ཕྱིར།
en: How should a bodhisattva practice it?’ ”

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། དུས་རྣམས་ཀུན་ཏུ་བྱུང་བའི་བདེ་གཤེགས་རྣམས། །མངོན་དུ་བྱ་བར་མོས་པའི་སེམས་དང་ལྡན། །དེ་དག་མིག་ཡངས་རྣམ་པར་དག་པར་འགྱུར། །དེས་ནི་སངས་རྒྱས་རྒྱ་མཚོ་མཐོང་བར་འོང་། །
en: Then at that time, the night goddess Samanta­gambhīra­śrī­vimala­prabhā, in order to emphasize and teach this bodhisattva liberation called complete subjugation through the bliss of the peace of śamatha, recited these verses to Sudhana, the head merchant’s son: “Those with a mind that aspires to be in the presence Of the sugatas that appear in the three times Will have a vast and pure eyesight And will see an ocean of the buddhas.

source: རྒྱལ་བའི་སྐུ་གསལ་དྲི་མ་མེད་ལ་ལྟོས། །མཚན་གྱིས་ཡོངས་སུ་རྒྱན་པས་ཤིན་ཏུ་མཛེས། །
en: {1} “See the bright, stainless body of the Jina Beautifully adorned by the signs of a great being!

source: རྒྱལ་བའི་རྣམ་པར་འཕྲུལ་པ་ཆོས་དབྱིངས་རྣམས། སྐད་ཅིག་རེ་རེས་རྒྱས་འགེངས་དེ་ལ་འང་ལྟོས། །
en: See the Jina’s miraculous manifestations That in an instant fill the realm of phenomena!

source: བྱང་ཆུབ་ཤིང་དྲུང་སངས་རྒྱས་གདན་རབ་ལ། །བདེ་གཤེགས་རྣམ་པར་སྣང་མཛད་མངོན་སངས་རྒྱས། །
en: {2} “The Sugata, the perfect Buddha, Vairocana Is upon the buddha throne under the Bodhi tree.
